In [1]:
import pandas as pd# Load the libaries for particular dataset. here the file is csv so we use the pandas libraries

In [2]:
dataset=pd.read_csv("Placement.csv")  # we have to give the placement dataset to variable via pd.read_csv

In [3]:
dataset  # i have to check my dataset how it is. so i will check it and this is the college placement data set ssc_p means tenth standard pass mark and ssc_b means tenth which board he/she studied same in hsc_p and hsc_b. hsc_s means higher secondary ல என்ன sub எடுத்து இருக்காங்க. degree_p means degree pass mark and degree_t means degree technical subject name. workex means work experience இருக்க. etest_p means entrance test pass mark என்ன. specialisation in mba. mba_p means mba pass mark. status means they will placed or not. salary means after placed how much pay. we have to read like this. so we have to take any column and analyse this. here quan columns are sl_no,ssc_p,hsc_p, degree_p, etest_p, mba_p and salary. and qual columns are gender, ssc_b, hsc_b,  hsc_s, degree_t,workex, specialisation and status.

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
210,211,M,80.60,Others,82.00,Others,Commerce,77.60,Comm&Mgmt,No,91.0,Mkt&Fin,74.49,Placed,400000.0
211,212,M,58.00,Others,60.00,Others,Science,72.00,Sci&Tech,No,74.0,Mkt&Fin,53.62,Placed,275000.0
212,213,M,67.00,Others,67.00,Others,Commerce,73.00,Comm&Mgmt,Yes,59.0,Mkt&Fin,69.72,Placed,295000.0
213,214,F,74.00,Others,66.00,Others,Commerce,58.00,Comm&Mgmt,No,70.0,Mkt&HR,60.23,Placed,204000.0
214,215,M,62.00,Central,58.00,Others,Science,53.00,Comm&Mgmt,No,89.0,Mkt&HR,60.22,Not Placed,NaN

In [4]:
from Univarite1 import Univarite1  # Already we have in faircopy so we give that
obj=Univarite1()

In [5]:
quan,qual=obj.QuanQual(dataset)  # Already we have in faircopy so we give that

Quan: ['sl_no', 'ssc_p', 'hsc_p', 'degree_p', 'etest_p', 'mba_p', 'salary']
Qual: ['gender', 'ssc_b', 'hsc_b', 'hsc_s', 'degree_t', 'workex', 'specialisation', 'status']

In [6]:
dataset["ssc_p"].mean() # This is the coding for finding mean.  This is my first kind of descriptive analysis. அந்த college ல படிச்ச 10th standard average pass mark வந்து 67. இது தான் அவங்களுடோ average performance.

67.3033953488372

In [7]:
dataset["ssc_p"].median() # This is the coding for finding median. so maximum இதுல outlier  இல்ல. Again what inference we take in mean same here also.

67.0

In [8]:
dataset["ssc_p"].mode() # This is the coding for find. இந்த 62 அதிக repetation and 62 mark தா அதிகமா எடுதிருங்காங்க

0    62.0
dtype: float64

In [9]:
dataset["ssc_p"].mode()[0] #here we want only 62.0 not dtype in previouse cell. For that we use this command

62.0

In [10]:
#NOW WE WANT TO CREATE A EMPTY TABLE. WE GIVEN A NAME Univariate FOR THAT TABLE. IN THAT TABLE WE INSERT THE MEAN, MEDIAN AND MODE

In [11]:
univariate=pd.DataFrame()# this coding is for  creating a empyty table

In [12]:
univariate # now we check and display this univariate

Empty DataFrame
Columns: []
Index: []

In [13]:
univariate=pd.DataFrame(index=["Mean","Median","Mode"],columns=quan) # Now we insert index (i.e) mean,median and mode in the empty table and also we insert all columns viz quan

In [14]:
univariate# here it display what we given in the univariate variable and in output  we not define any values so it shows nan values

       sl_no ssc_p hsc_p degree_p etest_p mba_p salary
Mean     NaN   NaN   NaN      NaN     NaN   NaN    NaN
Median   NaN   NaN   NaN      NaN     NaN   NaN    NaN
Mode     NaN   NaN   NaN      NaN     NaN   NaN    NaN

In [15]:
univariate["sl_no"]["Mean"] #next our task is to how to access this position.  so this is the command for thi

nan

In [16]:
univariate["ssc_p"]["Mean"] #next our task is to how to access this particular cell.  For that  i will give the respective column name and row name

nan

In [17]:
for column in quan:  # here quan have all column name so that will save in column now  
    print(column)    # here for our understand we give print statement to excute what in the column name
    univariate[column]["Mean"]=dataset[column].mean()# now in univatiate table we have column name, that will go the loop.  Next to that  we give row name (i.e) mean equal to dataset column name .mean()

sl_no
ssc_p
hsc_p
degree_p
etest_p
mba_p
salary

In [18]:
univariate # here the values will come instead nan values in first row

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
Mean,108.0,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
Median,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Mode,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [19]:
for column in quan:  #here we put median and mode same process like mean
    print(column)
    univariate[column]["Mean"]=dataset[column].mean()
    univariate[column]["Median"]=dataset[column].median()
    univariate[column]["Mode"]=dataset[column].mode()[0]# list ல இருக்க zero வந்து datatype காக

sl_no
ssc_p
hsc_p
degree_p
etest_p
mba_p
salary

In [20]:
univariate # here the values will come instead nan values in all row and this is very very important part for story telling

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
Mean,108.0,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
Median,108.0,67.0,65.0,66.0,71.0,62.0,265000.0
Mode,1,62.0,63.0,65.0,60.0,56.7,300000.0

In [21]:
#now we are  doing  the percentil process before we are describing how our dataset is

In [22]:
dataset.describe() # This is inbuilt function which is describe

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
count,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000,148.000000
mean,108.000000,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
std,62.209324,10.827205,10.897509,7.358743,13.275956,5.833385,93457.452420
min,1.000000,40.890000,37.000000,50.000000,50.000000,51.210000,200000.000000
25%,54.500000,60.600000,60.900000,61.000000,60.000000,57.945000,240000.000000
50%,108.000000,67.000000,65.000000,66.000000,71.000000,62.000000,265000.000000
75%,161.500000,75.700000,73.000000,72.000000,83.500000,66.255000,300000.000000
max,215.000000,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

In [23]:
import numpy as np #for calculating percentile this is the coding
np.percentile(dataset["ssc_p"],0) #Here 0 represent the min, next 25, 50, 75 and 100

40.89

In [24]:
import numpy as np
np.percentile(dataset["ssc_p"],25) #Here 25% people 60 value குள்ள இருகாங்க

60.599999999999994

In [25]:
np.percentile(dataset["ssc_p"],20) #Here 20% people ssc_p வந்து 60 mark  value குள்ள இருகாங்க

58.0

In [26]:
dataset["ssc_p"].min() #here min or zero same.  just we are cross checking whether 0 or min output is same or not

40.89

In [27]:
dataset["ssc_p"].max() #here max or 100% same.  just we are cross checking whether 100 or max output is same or not

89.4

In [28]:
univariate #we are displayin the numerical values in mean median and mode instead nan values

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
Mean,108.0,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
Median,108.0,67.0,65.0,66.0,71.0,62.0,265000.0
Mode,1,62.0,63.0,65.0,60.0,56.7,300000.0

In [29]:
dataset.isnull().sum() # we are checking the any nun values is there or not

sl_no              0
gender             0
ssc_p              0
ssc_b              0
hsc_p              0
hsc_b              0
hsc_s              0
degree_p           0
degree_t           0
workex             0
etest_p            0
specialisation     0
mba_p              0
status             0
salary            67
dtype: int64

In [30]:
dataset["salary"]=dataset["salary"].fillna(0) #here we are replcing nan value with zero using fillna in salary column

In [31]:
dataset["salary"].mode()[0]#here we are checking the mode for salary

0.0

In [32]:
univariate=pd.DataFrame(index=["Mean","Median","Mode","Min","25%","50%","75%","Max"],columns=quan)  # here we are inserting the index min,25,50,75, max
for column in quan:
    print(column)
    univariate[column]["Mean"]=dataset[column].mean()
    univariate[column]["Median"]=dataset[column].median()
    univariate[column]["Mode"]=dataset[column].mode()[0]
    univariate[column]["Min"]=dataset[column].min()    # and also we are inserting the calculated respective percentile in dataframe 
    univariate[column]["25%"]=np.percentile(dataset[column],25) # and also we are inserting the calculated respective percentile in dataframe 
    univariate[column]["50%"]=np.percentile(dataset[column],50) # and also we are inserting the calculated respective percentile in dataframe 
    univariate[column]["75%"]=np.percentile(dataset[column],75) # and also we are inserting the calculated respective percentile in dataframe 
    univariate[column]["Max"]=np.percentile(dataset[column],100)  # and also we are inserting the calculated respective percentile in dataframe

sl_no
ssc_p
hsc_p
degree_p
etest_p
mba_p
salary

In [33]:
univariate# here we are seeing the added QR, 1.5rule, Lesser and Greater in index and the resepective values

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
Mean,108.0,67.303395,66.333163,66.370186,72.100558,62.278186,198702.325581
Median,108.0,67.0,65.0,66.0,71.0,62.0,240000.0
Mode,1,62.0,63.0,65.0,60.0,56.7,0.0
Min,1,40.89,37.0,50.0,50.0,51.21,0.0
25%,54.5,60.6,60.9,61.0,60.0,57.945,0.0
50%,108.0,67.0,65.0,66.0,71.0,62.0,240000.0
75%,161.5,75.7,73.0,72.0,83.5,66.255,282500.0
Max,215.0,89.4,97.7,91.0,98.0,77.89,940000.0

In [ ]:
# Story Telling for above Univariate table
# I am taking sss_p: (Similar to other column)
   # min - 40.89
   # 25% - 60.6
   # 50% - 67 
   # 75% - 75.7
   # Max - 89.4
# All percentile of data  is near to near range. So conclusion is not more difference in percentile. So in placement cell we tell that for getting that job the ssc_p mark will be low for all